app/controllers/api/songs_controller.rb

    def index
        if params[:album_id] == "browse"
            @songs = Song.all
        else
            album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]