app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "session_token", "password_digest", "created_at", "updated_at", "gender") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
        @user = User.new(user_params)

        if @user.save