app/views/api/artists/index.json.jbuilder

SELECT "songs".* FROM "songs" INNER JOIN "albums" ON "songs"."album_id" = "albums"."id" WHERE "albums"."artist_id" = $1  [["artist_id", 1]]
---
    json.popular do
        @artist.songs.limit(5).each do |song|

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 1]]
---
json.albums do
    @artist.albums.each do |album|