app/views/api/artists/show.json.jbuilder

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 1]]
---
json.albums do
    @artist.albums.each do |album|